In [1]:
import numpy as np
import pandas as pd

In [6]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Alfred'],
                  "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                  "born": [pd.NaT, pd.Timestamp("1940-04-25"), pd.NaT]})

In [7]:
df.head()

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwomen   Bullwhip        NaT

 ## Drop Na

In [9]:
df.dropna(how='all', axis=1)

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwomen   Bullwhip        NaT

## Drop duplicates

In [15]:
df.drop_duplicates(subset=['name'], keep=False)           # axis isn't used because it doesn't take arguments

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwomen   Bullwhip        NaT

## Shape

In [16]:
df.shape

(3, 3)

## Info
---
Its a method that gives a lot of information about the df

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     2 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 204.0+ bytes

## Unique count

In [19]:
df['toy'].value_counts(dropna=False)

toy
NaN          1
Batmobile    1
Bullwhip     1
Name: count, dtype: int64

## NotNull
---
Where there's a null its False and vise versa

IsNull is opposite of this

In [20]:
df.notnull()

   name    toy   born
0  True  False  False
1  True   True   True
2  True   True  False